Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_IEE_APC.h
#define IEE_APC_REGION5_ACC_CTL_ALLOW_USER_MASK  (0x20000U)
#define IEE_APC_REGION5_ACC_CTL_ALLOW_USER_SHIFT (17U)
/*! ALLOW_USER - Allow user mode access
 *  0b0..Only privilege access to this region's registers is allowed
 *  0b1..User and privilege access to this region's registers is allowed
 */
#define IEE_APC_REGION5_ACC_CTL_ALLOW_USER(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION5_ACC_CTL_ALLOW_USER_SHIFT)) & IEE_APC_REGION5_ACC_CTL_ALLOW_USER_MASK)

#define IEE_APC_REGION5_ACC_CTL_LOCK_H_MASK      (0x80000000U)
#define IEE_APC_REGION5_ACC_CTL_LOCK_H_SHIFT     (31U)
/*! LOCK_H - Lock bit for the higher half word
 *  0b0..Higher half word is not locked
 *  0b1..Higher half word is locked
 */
#define IEE_APC_REGION5_ACC_CTL_LOCK_H(x)        (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION5_ACC_CTL_LOCK_H_SHIFT)) & IEE_APC_REGION5_ACC_CTL_LOCK_H_MASK)
/*! @} */

/*! @name REGION6_TOP_ADDR - End address of IEE region (n) */
/*! @{ */

#define IEE_APC_REGION6_TOP_ADDR_TOP_ADDR_MASK   (0xFFFFFFC0U)
#define IEE_APC_REGION6_TOP_ADDR_TOP_ADDR_SHIFT  (6U)
/*! TOP_ADDR - End address[31:6] of IEE region. The lower 6 address bits of IEE region is always 0. */
#define IEE_APC_REGION6_TOP_ADDR_TOP_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_TOP_ADDR_TOP_ADDR_SHIFT)) & IEE_APC_REGION6_TOP_ADDR_TOP_ADDR_MASK)
/*! @} */

/*! @name REGION6_BOT_ADDR - Start address of IEE region (n) */
/*! @{ */

#define IEE_APC_REGION6_BOT_ADDR_BOT_ADDR_MASK   (0xFFFFFFC0U)
#define IEE_APC_REGION6_BOT_ADDR_BOT_ADDR_SHIFT  (6U)
/*! BOT_ADDR - Start address[31:6] of IEE region. The lower 6 address bits of IEE region is always 0. */
#define IEE_APC_REGION6_BOT_ADDR_BOT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_BOT_ADDR_BOT_ADDR_SHIFT)) & IEE_APC_REGION6_BOT_ADDR_BOT_ADDR_MASK)
/*! @} */

/*! @name REGION6_ENA - Region enable for region (n) */
/*! @{ */

#define IEE_APC_REGION6_ENA_ENCRYPT_ENABLE_MASK  (0x1U)
#define IEE_APC_REGION6_ENA_ENCRYPT_ENABLE_SHIFT (0U)
/*! ENCRYPT_ENABLE - Enable this region
 *  0b0..This region is not enabled for IEE routing even hit
 *  0b1..This region is enabled for IEE routing once hit
 */
#define IEE_APC_REGION6_ENA_ENCRYPT_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ENA_ENCRYPT_ENABLE_SHIFT)) & IEE_APC_REGION6_ENA_ENCRYPT_ENABLE_MASK)
/*! @} */

/*! @name REGION6_ACC_CTL - Access control for IEE APC registers of region (n) */
/*! @{ */

#define IEE_APC_REGION6_ACC_CTL_ALLOW_DID_MASK   (0xFU)
#define IEE_APC_REGION6_ACC_CTL_ALLOW_DID_SHIFT  (0U)
/*! ALLOW_DID - Allowed domain ID */
#define IEE_APC_REGION6_ACC_CTL_ALLOW_DID(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ACC_CTL_ALLOW_DID_SHIFT)) & IEE_APC_REGION6_ACC_CTL_ALLOW_DID_MASK)

#define IEE_APC_REGION6_ACC_CTL_LOCK_L_MASK      (0x8000U)
#define IEE_APC_REGION6_ACC_CTL_LOCK_L_SHIFT     (15U)
/*! LOCK_L - Lock bit for the lower half word
 *  0b0..Lower half word is not locked
 *  0b1..Lower half word is locked
 */
#define IEE_APC_REGION6_ACC_CTL_LOCK_L(x)        (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ACC_CTL_LOCK_L_SHIFT)) & IEE_APC_REGION6_ACC_CTL_LOCK_L_MASK)

#define IEE_APC_REGION6_ACC_CTL_ALLOW_NS_MASK    (0x10000U)
#define IEE_APC_REGION6_ACC_CTL_ALLOW_NS_SHIFT   (16U)
/*! ALLOW_NS - Allow nonsecure mode access
 *  0b0..Only secure access to this region's registers is allowed
 *  0b1..Secure and nonsecure access to this region's registers is allowed
 */
#define IEE_APC_REGION6_ACC_CTL_ALLOW_NS(x)      (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ACC_CTL_ALLOW_NS_SHIFT)) & IEE_APC_REGION6_ACC_CTL_ALLOW_NS_MASK)

#define IEE_APC_REGION6_ACC_CTL_ALLOW_USER_MASK  (0x20000U)
#define IEE_APC_REGION6_ACC_CTL_ALLOW_USER_SHIFT (17U)
/*! ALLOW_USER - Allow user mode access
 *  0b0..Only privilege access to this region's registers is allowed
 *  0b1..User and privilege access to this region's registers is allowed
 */
#define IEE_APC_REGION6_ACC_CTL_ALLOW_USER(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ACC_CTL_ALLOW_USER_SHIFT)) & IEE_APC_REGION6_ACC_CTL_ALLOW_USER_MASK)

#define IEE_APC_REGION6_ACC_CTL_LOCK_H_MASK      (0x80000000U)
#define IEE_APC_REGION6_ACC_CTL_LOCK_H_SHIFT     (31U)
/*! LOCK_H - Lock bit for the higher half word
 *  0b0..Higher half word is not locked
 *  0b1..Higher half word is locked
 */
#define IEE_APC_REGION6_ACC_CTL_LOCK_H(x)        (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION6_ACC_CTL_LOCK_H_SHIFT)) & IEE_APC_REGION6_ACC_CTL_LOCK_H_MASK)
/*! @} */

/*! @name REGION7_TOP_ADDR - End address of IEE region (n) */
/*! @{ */

#define IEE_APC_REGION7_TOP_ADDR_TOP_ADDR_MASK   (0xFFFFFFC0U)
#define IEE_APC_REGION7_TOP_ADDR_TOP_ADDR_SHIFT  (6U)
/*! TOP_ADDR - End address[31:6] of IEE region. The lower 6 address bits of IEE region is always 0. */
#define IEE_APC_REGION7_TOP_ADDR_TOP_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_TOP_ADDR_TOP_ADDR_SHIFT)) & IEE_APC_REGION7_TOP_ADDR_TOP_ADDR_MASK)
/*! @} */

/*! @name REGION7_BOT_ADDR - Start address of IEE region (n) */
/*! @{ */

#define IEE_APC_REGION7_BOT_ADDR_BOT_ADDR_MASK   (0xFFFFFFC0U)
#define IEE_APC_REGION7_BOT_ADDR_BOT_ADDR_SHIFT  (6U)
/*! BOT_ADDR - Start address[31:6] of IEE region. The lower 6 address bits of IEE region is always 0. */
#define IEE_APC_REGION7_BOT_ADDR_BOT_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_BOT_ADDR_BOT_ADDR_SHIFT)) & IEE_APC_REGION7_BOT_ADDR_BOT_ADDR_MASK)
/*! @} */

/*! @name REGION7_ENA - Region enable for region (n) */
/*! @{ */

#define IEE_APC_REGION7_ENA_ENCRYPT_ENABLE_MASK  (0x1U)
#define IEE_APC_REGION7_ENA_ENCRYPT_ENABLE_SHIFT (0U)
/*! ENCRYPT_ENABLE - Enable this region
 *  0b0..This region is not enabled for IEE routing even hit
 *  0b1..This region is enabled for IEE routing once hit
 */
#define IEE_APC_REGION7_ENA_ENCRYPT_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ENA_ENCRYPT_ENABLE_SHIFT)) & IEE_APC_REGION7_ENA_ENCRYPT_ENABLE_MASK)
/*! @} */

/*! @name REGION7_ACC_CTL - Access control for IEE APC registers of region (n) */
/*! @{ */

#define IEE_APC_REGION7_ACC_CTL_ALLOW_DID_MASK   (0xFU)
#define IEE_APC_REGION7_ACC_CTL_ALLOW_DID_SHIFT  (0U)
/*! ALLOW_DID - Allowed domain ID */
#define IEE_APC_REGION7_ACC_CTL_ALLOW_DID(x)     (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ACC_CTL_ALLOW_DID_SHIFT)) & IEE_APC_REGION7_ACC_CTL_ALLOW_DID_MASK)

#define IEE_APC_REGION7_ACC_CTL_LOCK_L_MASK      (0x8000U)
#define IEE_APC_REGION7_ACC_CTL_LOCK_L_SHIFT     (15U)
/*! LOCK_L - Lock bit for the lower half word
 *  0b0..Lower half word is not locked
 *  0b1..Lower half word is locked
 */
#define IEE_APC_REGION7_ACC_CTL_LOCK_L(x)        (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ACC_CTL_LOCK_L_SHIFT)) & IEE_APC_REGION7_ACC_CTL_LOCK_L_MASK)

#define IEE_APC_REGION7_ACC_CTL_ALLOW_NS_MASK    (0x10000U)
#define IEE_APC_REGION7_ACC_CTL_ALLOW_NS_SHIFT   (16U)
/*! ALLOW_NS - Allow nonsecure mode access
 *  0b0..Only secure access to this region's registers is allowed
 *  0b1..Secure and nonsecure access to this region's registers is allowed
 */
#define IEE_APC_REGION7_ACC_CTL_ALLOW_NS(x)      (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ACC_CTL_ALLOW_NS_SHIFT)) & IEE_APC_REGION7_ACC_CTL_ALLOW_NS_MASK)

#define IEE_APC_REGION7_ACC_CTL_ALLOW_USER_MASK  (0x20000U)
#define IEE_APC_REGION7_ACC_CTL_ALLOW_USER_SHIFT (17U)
/*! ALLOW_USER - Allow user mode access
 *  0b0..Only privilege access to this region's registers is allowed
 *  0b1..User and privilege access to this region's registers is allowed
 */
#define IEE_APC_REGION7_ACC_CTL_ALLOW_USER(x)    (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ACC_CTL_ALLOW_USER_SHIFT)) & IEE_APC_REGION7_ACC_CTL_ALLOW_USER_MASK)

#define IEE_APC_REGION7_ACC_CTL_LOCK_H_MASK      (0x80000000U)
#define IEE_APC_REGION7_ACC_CTL_LOCK_H_SHIFT     (31U)
/*! LOCK_H - Lock bit for the higher half word
 *  0b0..Higher half word is not locked
 *  0b1..Higher half word is locked
 */
#define IEE_APC_REGION7_ACC_CTL_LOCK_H(x)        (((uint32_t)(((uint32_t)(x)) << IEE_APC_REGION7_ACC_CTL_LOCK_H_SHIFT)) & IEE_APC_REGION7_ACC_CTL_LOCK_H_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group IEE_APC_Register_Masks */


/*!
 * @}
 */ /* end of group IEE_APC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_IEE_APC_H_ */

